/*
This file is part of Giswater
The program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
*/


SET search_path = SCHEMA_NAME, public, pg_catalog;
UPDATE config_toolbox AS t SET alias = v.alias, observ = v.observ FROM (
	VALUES
	(2102, 'Перевірити дуги без початкового/кінцевого вузла', NULL),
    (2104, 'Перевірити дуги з однаковим початковим/кінцевим вузлом', NULL),
    (2106, 'Перевірити дубльовані з''єднання', NULL),
    (2108, 'Перевірити дубльовані вузли', NULL),
    (2110, 'Перевірити осиротілі вузли', NULL),
    (2118, 'Побудувати вузли, використовуючи початкові & кінцеві вершини дуг', NULL),
    (2436, 'Перевірити дані плану', NULL),
    (2670, 'Перевірити дані для o&m процесу', NULL),
    (2760, 'Отримати значення з растрового DEM', NULL),
    (2772, 'Аналіз трасування потоку', NULL),
    (2776, 'Перевірити конфігурацію бекенду', NULL),
    (2826, 'Система лінійних відліків', NULL),
    (2890, 'Вартість реконструкції & значення амортизації', NULL),
    (2922, 'Скинути профіль користувача', NULL),
    (2998, 'Користувач перевірка даних', NULL),
    (3008, 'Дуга зворотна', NULL),
    (3040, 'Перевірити дублікати дуг', NULL),
    (3042, 'Керувати значеннями Dscenario', NULL),
    (3052, 'Дуги коротші/довші за певну довжину', NULL),
    (3080, 'Відновити дубльовані вузли (по одному)', NULL),
    (3130, 'Топоконтроль для міграції даних', NULL),
    (3134, 'Створити порожній Dscenario', NULL),
    (3156, 'Дублювати dscenario', NULL),
    (3172, 'Перевірити вузли T кандидати', NULL),
    (3198, 'Отримати значення адреси з найближчого номера вулиці', NULL),
    (3280, 'Масове оновлення обертання вузлів', NULL),
    (3284, 'Об''єднати два або більше psectors в один', NULL),
    (3336, 'Макромінсектор аналіз', NULL),
    (3426, 'Інтегрувати кампанію у виробництво', NULL),
    (3482, 'Макрокартозони аналіз', NULL),
    (2302, 'Перевірити топологічну узгодженість вузла', NULL),
    (2430, 'Перевірити дані відповідно до правил EPA', NULL),
    (2496, 'Перепідключити дуги до найближчих вузлів', NULL),
    (2706, 'Мінсектор аналіз', NULL),
    (2768, 'Аналіз картозон', NULL),
    (2790, 'Перевірити дані для процесу graphanalytics', NULL),
    (2970, 'Налаштувати мапзони', NULL),
    (3108, 'Створити Мережевий Dсценарій з ToC', NULL),
    (3110, 'Створити Попит Dсценарій з CRM', NULL),
    (3112, 'Створити Попит Dсценарій з ToC', NULL),
    (3142, 'Баланс води за Експлуатацією та Періодом', NULL),
    (3158, 'Створити клапан dсценарій з mincut', NULL),
    (3160, 'Обчислити досяжність гідрантів', 'Функція вимагає даних вулиць, вставлених у таблицю om_streetaxis, де кожна вулиця поділена на короткі лінії між перехрестями.'),
    (3236, 'Показати поточні mincuts', NULL),
    (3256, 'Мапзони Nсценарій аналіз', NULL),
    (3258, 'Встановити значення шаблону на попит dсценарій', NULL),
    (3260, 'Створити порожній Nсценарій', NULL),
    (3262, 'Створити Nсценарій з ToC', NULL),
    (3264, 'Дублювати Nсценарій', NULL),
    (3268, 'Встановити initlevel значення із виконаної симуляції', NULL),
    (3308, 'Створити повний Мережний dсценарій', NULL),
    (3322, 'Встановити вартість видаленого матеріалу на pсектори', NULL)
) AS v(id, alias, observ)
WHERE t.id = v.id;

