/*
This file is part of Giswater
The program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
*/


SET search_path = SCHEMA_NAME, public, pg_catalog;
UPDATE config_toolbox AS t SET alias = v.alias, observ = v.observ FROM (
	VALUES
	(2202, 'Перевірити перетнуті дуги', NULL),
    (2204, 'Перевірити дуги з інвертованим нахилом', NULL),
    (2206, 'Перевірити вузли: знайти вихідні дуги над вхідними дугами', NULL),
    (2208, 'Перевірити вузли з більш ніж одним виходом', NULL),
    (2210, 'Перевірити вузли як витік', NULL),
    (2212, 'Перевірити топологічну узгодженість вузлів', NULL),
    (2431, 'Перевірити дані відповідно до правил EPA', NULL),
    (2496, 'Відновлення дуги', NULL),
    (2768, 'Картозони аналіз', NULL),
    (2986, 'Сумісність нахилу', NULL),
    (3064, 'Перевірити значення висот вузлів', NULL),
    (3066, 'Перевірити значення висот дуг', NULL),
    (3100, 'Керувати значеннями гідрології', NULL),
    (3102, 'Керувати значеннями Dwf', NULL),
    (3118, 'Створити Dscenario зі значеннями з ToC', NULL),
    (3176, 'Контролювати перерізи трубопроводів', NULL),
    (3186, 'Встановити перехрестя як вихід', NULL),
    (3242, 'Встановити оптимальний вихід для підзбірних басейнів', NULL),
    (3290, 'Створити порожній сценарій гідрології', NULL),
    (3292, 'Створити порожній DWF сценарій', NULL),
    (3294, 'Дублювати сценарій гідрології', NULL),
    (3296, 'Дублювати сценарій DWF', NULL),
    (3326, 'Обчислити гідравлічну продуктивність для конкретного результату', NULL),
    (3360, 'Створити Thyssen підбасейни', NULL),
    (3424, 'Аналіз типу рідини', NULL),
    (3492, 'Omunit аналіз', NULL),
    (3522, 'Аналіз типу обробки', NULL),
    (2102, 'Перевірити дуги без початкового/кінцевого вузла', NULL),
    (2104, 'Перевірити дуги з однаковим початковим/кінцевим вузлом', NULL),
    (2106, 'Перевірити дубльовані з''єднання', NULL),
    (2108, 'Перевірити дубльовані вузли', NULL),
    (2110, 'Перевірити осиротілі вузли', NULL),
    (2118, 'Побудувати вузли, використовуючи початкові & кінцеві вершини дуг', NULL),
    (2436, 'Перевірити дані плану', NULL),
    (2670, 'Перевірити дані для o&m процесу', NULL),
    (2760, 'Отримати значення з растрового DEM', NULL),
    (2772, 'Аналіз трасування потоку', NULL),
    (2776, 'Перевірити конфігурацію бекенду', NULL),
    (2826, 'Система лінійних відліків', NULL),
    (2890, 'Вартість реконструкції & значення амортизації', NULL),
    (2922, 'Скинути профіль користувача', NULL),
    (2998, 'Користувач перевірка даних', NULL),
    (3008, 'Дуга зворотна', NULL),
    (3040, 'Перевірити дублікати дуг', NULL),
    (3042, 'Керувати значеннями Dscenario', NULL),
    (3052, 'Дуги коротші/довші за певну довжину', NULL),
    (3080, 'Відновити дубльовані вузли (по одному)', NULL),
    (3130, 'Топоконтроль для міграції даних', NULL),
    (3134, 'Створити порожній Dscenario', NULL),
    (3156, 'Дублювати dscenario', NULL),
    (3172, 'Перевірити вузли T кандидати', NULL),
    (3198, 'Отримати значення адреси з найближчого номера вулиці', NULL),
    (3280, 'Масове оновлення обертання вузлів', NULL),
    (3284, 'Об''єднати два або більше psectors в один', NULL),
    (3336, 'Макромінсектор аналіз', NULL),
    (3426, 'Інтегрувати кампанію у виробництво', NULL),
    (3482, 'Макрокартозони аналіз', NULL)
) AS v(id, alias, observ)
WHERE t.id = v.id;

